#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	
	ЕАС_ОбластиДанныхКопируемый.НазначитьОбластьДанных(ЭтотОбъект);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтотУзел Тогда
		Если Не ЗначениеЗаполнено(Код) Тогда
			ТекстОшибки = НСтр("ru='Код узла не может быть пустым.'");
  			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,
			   	ЭтотОбъект,
   				"Код",
				,
   				Отказ);  
	    КонецЕсли;
	
	ИначеЕсли ЕАС_ОбменСерверПовтИспКопируемый.КодЭтогоУзла("ОбменЕАСБухгалтерия") = КодКорреспондента Тогда
		ТекстОшибки = НСтр("ru='Коды главных узлов текущая и корреспондента должны быть разные.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,
			   	ЭтотОбъект,
   				"КодКорреспондента",
				,
   				Отказ);  
	КонецЕсли;	
			
	Если Не ЗначениеЗаполнено(Код) И Не ЭтотУзел Тогда
		ТекстОшибки = НСтр("ru = 'Код должен был заполнен.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,
		   	ЭтотОбъект,
   			"Код",
			,
   			Отказ);  
	КонецЕсли;
		
	
	Если Не ЭтотУзел И Не Отказ Тогда	
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Обмен.Ссылка КАК Ссылка
		               |ИЗ
		               |	ПланОбмена.ОбменЕАСБухгалтерия КАК Обмен
		               |ГДЕ
		               |	Обмен.КодКорреспондента = &КодКорреспондента
		               |	И Обмен.ОбластьДанныхКорреспондента = &ОбластьКорреспондента
		               |	И Обмен.Ссылка <> &Ссылка
		               |	И Обмен.ОбластьДанных = &ОбластьДанных";
	
		Запрос.УстановитьПараметр("Ссылка", 		   	   Ссылка);
		Запрос.УстановитьПараметр("ОбластьДанных", 		   ОбластьДанных);
		Запрос.УстановитьПараметр("КодКорреспондента",     КодКорреспондента);
		Запрос.УстановитьПараметр("ОбластьКорреспондента", ОбластьДанныхКорреспондента);
	
		Если Не Запрос.Выполнить().Пустой() Тогда
			ТекстОшибки = НСтр("ru = 'Код должен был уникален.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,
			   	ЭтотОбъект,
	   			"Код",
				,
	   			Отказ);  
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
