#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЕАС_ОбластиДанныхКопируемый.НазначитьОбластьДанных(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЕАС_ОбластиДанныхКопируемый.НазначитьОбластьДанных(ЭтотОбъект);
	
	ЕАС_ОбменВызовСервераКопируемый.ЗарегистрироватьИзмененияДокумента(ЭтотОбъект);
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;	

	Если ДатаОкончания < ДатаНачала Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = '%1 - Дата окончание (%2) не может быть меньше даты начала(%3).'"),
									ЭтотОбъект,
									ДатаОкончания,
									ДатаНачала);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,"ДатаОкончания",, Отказ); 							
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	ЕАС_ОбменВызовСервераКопируемый.ЗарегистрироватьИзмененияДокумента(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли