#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"ОбластьДанных",
	                                                                        ЕАС_ОбластиДанныхКопируемый.ОбластьДанныхДляОбъектов(),
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			Истина,
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
																			// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти