#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ЭтотУзел Тогда
		Элементы.Организации.Видимость 						= Ложь;
		Элементы.ИспользоватьОтборПоОрганизациям.Видимость 	= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоОрганизациямПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимость()      
	Элементы.Организации.Видимость = Не Объект.ЭтотУзел И Объект.ИспользоватьОтборПоОрганизациям;
	Элементы.ГруппаКорреспондент.Видимость = Не Объект.ЭтотУзел;
	Элементы.ОбластьДанных.Видимость       = Не Объект.ЭтотУзел;
КонецПроцедуры	


#КонецОбласти
