#Область ПрограммныйИнтерфейс

// Возвращает значение параметра по умолчанию по типу. Например для числа возвращает 0, для ссылок - пустую ссылку
//
// Параметры:
// ПараметрТип - Строка - Имя типа XML,
// ПараметрСписок - Булево - Параметр является списком.
//
// Возвращаемое значение:
//   Произвольный - Возвращает "пустое" значение. Для списков возвращает пустой список определенного типа.
//
Функция ЗначениеПараметраПоУмолчанию(ПараметрТип, ПараметрСписок) Экспорт             
	Если XMLТип(Тип("Число")).ИмяТипа = ПараметрТип Тогда
		ТекущийТип = Тип("Число");
	ИначеЕсли XMLТип(Тип("Строка")).ИмяТипа = ПараметрТип Тогда
		ТекущийТип = Тип("Строка");
	ИначеЕсли XMLТип(Тип("Дата")).ИмяТипа = ПараметрТип Тогда
		ТекущийТип = Тип("Дата");
	ИначеЕсли XMLТип(Тип("Булево")).ИмяТипа = ПараметрТип Тогда
		ТекущийТип = Тип("Булево");
	Иначе	
		ТекущийТип = Тип(ПараметрТип);
	КонецЕсли;	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТекущийТип);
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	Если ПараметрСписок Тогда
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.ТипЗначения = ОписаниеТипов;
		Результат = СписокЗначений;
	Иначе	
		Значение = ОписаниеТипов.ПривестиЗначение(ТекущийТип);
		Результат = Значение;
	КонецЕсли;	
	Возврат Результат;
КонецФункции

#КонецОбласти

